-- phpMyAdmin SQL Dump
-- version 5.0.4
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Nov 17, 2021 at 07:10 PM
-- Server version: 10.5.8-MariaDB
-- PHP Version: 7.4.20

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `mosaic`
--

DELIMITER $$
--
-- Procedures
--
DROP PROCEDURE IF EXISTS `stocks_wo_backlog`$$
CREATE DEFINER=`root`@`localhost` PROCEDURE `stocks_wo_backlog` ()  NO SQL
SELECT `vendor_code`, sum(`count`) as `c` FROM `stock` GROUP by `vendor_code` ORDER by `c`$$

DELIMITER ;

-- --------------------------------------------------------

--
-- Table structure for table `move_types`
--

DROP TABLE IF EXISTS `move_types`;
CREATE TABLE IF NOT EXISTS `move_types` (
  ` move_name` varchar(50) NOT NULL,
  `move_desc` varchar(1024) NOT NULL,
  PRIMARY KEY (` move_name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `move_types`
--

INSERT INTO `move_types` (` move_name`, `move_desc`) VALUES
('BACKLOG', 'Резерв под оплаченный заказ'),
('INCOME', 'Поступление'),
('LOST', 'Утеря');

-- --------------------------------------------------------

--
-- Table structure for table `stock`
--

DROP TABLE IF EXISTS `stock`;
CREATE TABLE IF NOT EXISTS `stock` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `vendor_code` varchar(50) NOT NULL,
  `move` varchar(50) NOT NULL,
  `description` varchar(1024) NOT NULL,
  `move_date` date NOT NULL,
  `count` int(11) NOT NULL,
  `create_time` timestamp NOT NULL DEFAULT current_timestamp(),
  `change_time` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`id`),
  KEY `move` (`move`)
) ENGINE=InnoDB AUTO_INCREMENT=105 DEFAULT CHARSET=utf8;

--
-- Dumping data for table `stock`
--

INSERT INTO `stock` (`id`, `vendor_code`, `move`, `description`, `move_date`, `count`, `create_time`, `change_time`) VALUES
(1, 'A07', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 4205, '2021-11-17 17:56:55', '2021-11-17 18:00:56'),
(3, 'A32', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 2523, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(4, 'A09', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 2523, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(5, 'A06', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 2523, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(6, 'A01', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 2523, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(7, 'A42', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 1682, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(8, 'A44', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 1682, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(9, 'A36', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 1682, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(10, 'A60', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 1682, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(11, 'A43', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 1682, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(12, 'A54', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 1682, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(13, 'A17', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 1682, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(14, 'A86', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(15, 'A35', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(16, 'A49', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(17, 'A11', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(18, 'A14', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(19, 'A85', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(20, 'A52', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(21, 'A13', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(22, 'A34', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(23, 'A12', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(24, 'A21', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(25, 'A62', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(26, 'A04', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(27, 'A92', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(28, 'A33', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(29, 'A63', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(30, 'A03', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(31, 'A67', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(32, 'A73', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(33, 'A87', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(34, 'A30', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(35, 'A90', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(36, 'A58', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(37, 'A26', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(38, 'A22', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(39, 'A02', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(40, 'A38', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(41, 'A77', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(42, 'A15', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(43, 'A25', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(44, 'A82', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(45, 'A23', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:55', '2021-11-17 18:20:55'),
(46, 'A18', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:56', '2021-11-17 18:20:56'),
(47, 'A45', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:56', '2021-11-17 18:20:56'),
(48, 'A16', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:56', '2021-11-17 18:20:56'),
(49, 'A20', 'INCOME', 'Покупка в Grand Мозаике', '2021-11-15', 841, '2021-11-17 18:20:56', '2021-11-17 18:20:56'),
(50, 'A07', 'LOST', 'Недостача', '2021-11-15', -3, '2021-11-17 18:31:22', '2021-11-17 18:31:22'),
(51, 'A42', 'LOST', 'Недостача', '2021-11-15', -1, '2021-11-17 18:31:22', '2021-11-17 18:31:22'),
(52, 'A26', 'LOST', 'Недостача', '2021-11-15', -1, '2021-11-17 18:32:31', '2021-11-17 18:32:31'),
(53, 'A25', 'LOST', 'Недостача', '2021-11-15', -1, '2021-11-17 18:32:31', '2021-11-17 18:32:31'),
(54, 'A90', 'LOST', 'Избыток в поставке', '2021-11-15', 17, '2021-11-17 18:33:28', '2021-11-17 18:33:28'),
(55, 'A07', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -3889, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(56, 'A32', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -2286, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(57, 'A09', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -2279, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(58, 'A06', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -1889, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(59, 'A01', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -1710, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(60, 'A42', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -1631, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(61, 'A44', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -1573, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(62, 'A36', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -1095, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(63, 'A60', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -1089, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(64, 'A43', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -1063, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(65, 'A54', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -884, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(66, 'A17', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -848, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(67, 'A86', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -835, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(68, 'A35', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -820, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(69, 'A49', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -720, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(70, 'A11', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -651, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(71, 'A14', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -538, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(72, 'A85', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -536, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(73, 'A52', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -450, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(74, 'A13', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -438, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(75, 'A34', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -407, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(76, 'A12', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -405, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(77, 'A21', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -376, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(78, 'A62', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -305, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(79, 'A04', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -303, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(80, 'A92', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -287, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(81, 'A33', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -269, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(82, 'A63', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -261, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(83, 'A03', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -222, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(84, 'A67', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -204, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(85, 'A73', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -185, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(86, 'A87', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -177, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(87, 'A30', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -163, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(88, 'A90', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -160, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(89, 'A58', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -154, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(90, 'A26', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -150, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(91, 'A22', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -128, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(92, 'A02', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -123, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(93, 'A38', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -117, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(94, 'A77', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -90, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(95, 'A15', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -87, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(96, 'A25', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -82, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(97, 'A82', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -59, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(98, 'A23', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -36, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(99, 'A18', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -11, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(100, 'A45', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -8, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(101, 'A16', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -4, '2021-11-17 18:45:55', '2021-11-17 18:45:55'),
(103, 'A20', 'BACKLOG', 'Под заказ рыббы', '2021-11-16', -1, '2021-11-17 18:45:56', '2021-11-17 18:45:56'),
(104, 'A87', 'BACKLOG', 'Под заказ рыббы (вместо A96)', '2021-11-16', -2, '2021-11-17 18:55:43', '2021-11-17 18:55:43');

--
-- Constraints for dumped tables
--

--
-- Constraints for table `stock`
--
ALTER TABLE `stock`
  ADD CONSTRAINT `stock_ibfk_1` FOREIGN KEY (`move`) REFERENCES `move_types` (` move_name`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
